Kubernetes/cloudlab/results/30-05-24 copy/13/hotelReservation/5/k8s-hr-wrk-mixed-c6525-25g-exp13-havail0-hori1-verti0-infi1-client-t8-c512-d30-R1500-N5
No argument supplied nginx
using  args: threads=8 and connections=512 and duration=30 and requests=1500
Running 30s test @ http://localhost:5000
  8 threads and 512 connections
  Thread calibration: mean lat.: 2.950ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.931ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.886ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.038ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.942ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.991ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.981ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 3.040ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.97ms    1.30ms   7.04ms   74.36%
    Req/Sec   195.87    143.32   600.00     72.41%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.54ms
 75.000%    3.65ms
 90.000%    4.78ms
 99.000%    7.04ms
 99.900%    8.85ms
 99.990%   10.65ms
 99.999%   37.18ms
100.000%   37.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.014     0.000000            1         1.00
       1.662     0.100000         2969         1.11
       1.955     0.200000         5944         1.25
       2.137     0.300000         8930         1.43
       2.317     0.400000        11871         1.67
       2.543     0.500000        14829         2.00
       2.697     0.550000        16320         2.22
       2.917     0.600000        17798         2.50
       3.153     0.650000        19285         2.86
       3.393     0.700000        20764         3.33
       3.649     0.750000        22248         4.00
       3.789     0.775000        22987         4.44
       3.945     0.800000        23730         5.00
       4.115     0.825000        24468         5.71
       4.319     0.850000        25218         6.67
       4.535     0.875000        25956         8.00
       4.647     0.887500        26326         8.89
       4.779     0.900000        26689        10.00
       4.939     0.912500        27059        11.43
       5.111     0.925000        27434        13.33
       5.303     0.937500        27800        16.00
       5.415     0.943750        27986        17.78
       5.527     0.950000        28174        20.00
       5.671     0.956250        28358        22.86
       5.835     0.962500        28542        26.67
       6.031     0.968750        28730        32.00
       6.143     0.971875        28820        35.56
       6.243     0.975000        28912        40.00
       6.363     0.978125        29005        45.71
       6.503     0.981250        29099        53.33
       6.655     0.984375        29190        64.00
       6.751     0.985938        29237        71.11
       6.847     0.987500        29284        80.00
       6.963     0.989062        29329        91.43
       7.107     0.990625        29376       106.67
       7.239     0.992188        29422       128.00
       7.319     0.992969        29445       142.22
       7.427     0.993750        29468       160.00
       7.507     0.994531        29491       182.86
       7.671     0.995313        29517       213.33
       7.855     0.996094        29538       256.00
       7.967     0.996484        29550       284.44
       8.075     0.996875        29561       320.00
       8.231     0.997266        29573       365.71
       8.351     0.997656        29584       426.67
       8.463     0.998047        29597       512.00
       8.527     0.998242        29601       568.89
       8.639     0.998437        29607       640.00
       8.727     0.998633        29613       731.43
       8.823     0.998828        29620       853.33
       8.879     0.999023        29625      1024.00
       9.087     0.999121        29627      1137.78
       9.223     0.999219        29630      1280.00
       9.351     0.999316        29633      1462.86
       9.431     0.999414        29636      1706.67
       9.655     0.999512        29639      2048.00
       9.695     0.999561        29640      2275.56
       9.807     0.999609        29643      2560.00
       9.807     0.999658        29643      2925.71
       9.831     0.999707        29645      3413.33
       9.927     0.999756        29646      4096.00
       9.951     0.999780        29647      4551.11
      10.407     0.999805        29648      5120.00
      10.407     0.999829        29648      5851.43
      10.487     0.999854        29649      6826.67
      10.655     0.999878        29650      8192.00
      10.655     0.999890        29650      9102.22
      10.935     0.999902        29651     10240.00
      10.935     0.999915        29651     11702.86
      10.935     0.999927        29651     13653.33
      11.367     0.999939        29652     16384.00
      11.367     0.999945        29652     18204.44
      11.367     0.999951        29652     20480.00
      11.367     0.999957        29652     23405.71
      11.367     0.999963        29652     27306.67
      37.183     0.999969        29653     32768.00
      37.183     1.000000        29653          inf
#[Mean    =        2.969, StdDeviation   =        1.301]
#[Max     =       37.152, Total count    =        29653]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  44441 requests in 30.01s, 18.43MB read
  Socket errors: connect 0, read 0, write 0, timeout 21
Requests/sec:   1480.92
Transfer/sec:    628.84KB